### Задачи на использование `print()`

1. Напишите программу, которая выводит на экран строку "Hello, World!".
2. Напишите программу, которая выводит на экран ваше имя.
3. Напишите программу, которая выводит на экран текущую дату и время.
4. Напишите программу, которая выводит на экран таблицу умножения для числа 5.
5. Напишите программу, которая выводит на экран все числа от 1 до 10.

### Задачи на арифметические выражения

6. Напишите программу, которая вычисляет сумму двух чисел, введенных пользователем.
7. Напишите программу, которая вычисляет произведение двух чисел, введенных пользователем.
8. Напишите программу, которая вычисляет разность двух чисел, введенных пользователем.
9. Напишите программу, которая вычисляет частное двух чисел, введенных пользователем.
10. Напишите программу, которая вычисляет остаток от деления двух чисел, введенных пользователем.

### Задачи на циклы `for`

11. Напишите программу, которая выводит на экран все числа от 1 до 20.
12. Напишите программу, которая выводит на экран все четные числа от 1 до 20.
13. Напишите программу, которая выводит на экран все нечетные числа от 1 до 20.
14. Напишите программу, которая выводит на экран квадраты всех чисел от 1 до 10.
15. Напишите программу, которая выводит на экран факториал числа, введенного пользователем.

### Задачи на циклы `while`

16. Напишите программу, которая выводит на экран все числа от 1 до 10, используя цикл `while`.
17. Напишите программу, которая выводит на экран все четные числа от 1 до 20, используя цикл `while`.
18. Напишите программу, которая выводит на экран все нечетные числа от 1 до 20, используя цикл `while`.
19. Напишите программу, которая выводит на экран квадраты всех чисел от 1 до 10, используя цикл `while`.
20. Напишите программу, которая выводит на экран факториал числа, введенного пользователем, используя цикл `while`.

### Задачи на условные конструкции

21. Напишите программу, которая проверяет, является ли число, введенное пользователем, четным или нечетным.
22. Напишите программу, которая проверяет, является ли число, введенное пользователем, положительным или отрицательным.
23. Напишите программу, которая проверяет, является ли число, введенное пользователем, простым.
24. Напишите программу, которая проверяет, является ли число, введенное пользователем, делимым на 3 и на 5 одновременно.
25. Напишите программу, которая проверяет, является ли число, введенное пользователем, палиндромом.

### Шпаргалка

1. Про вывод
```python
a = input("Введите строку") # переменная а будет иметь тип данных строка
b = int(input("Введите число")) # если хотим забрать целое число
с = float(input("Введите число с точкой")) # если хотим забрать десятичное число

# ШАБЛОН
# a = <необходимый тип данных>(input()) 

# Деление строки в массив
a = input().split() # таким образом строка вида "я не хочу кушать", превратится в список ["я", "не", "хочу", "кушать"]. Строка поделилась по пробелам
b = input().split(',') # таким образом строка вида "Привет, мир!", превратится в список ["Привет", " мир!"]. Строка поделилась по запятым и заметьте, что в слове мир стоит пробел вначале
```

2. Про арифметику
```python
a = int(input())
b = int(input())
print(a+b)

# обычные операции - +,-,*,/
# возведение в степень <какое число мы возводим> ** <в какую степень возводим>
# расширенные операции деления:
# целочисленное деление //. При делении 10 // 3 мы получим в ответе, сколько целых раз 3 помещается в 10, то есть 3 (3 * 3 = 9 и 1 в остатке)
# остаточное деление %. При делении 10 % 3 в ответе мы получим только остаток от деленя, то есть 1 (3 * 3 = 9 и 1 в остатке)

# Если вы хотите проверить кратность одного числа другому, то используйте след. конструкцию
if a % n == 0:
	print(1)
# В данном примере, мы проверяем условие, что а кратно n. То есть, при делении a на n остаток равен нулю (чётные числа, числа, которые кратны 2)
if a % n != 0:
	print(2)
# В данном примере, мы проверяем условие, что а не кратно n. То есть, при делении a на n остаток не равен нулю
```

3. Про циклы
```python
# Цикл for проходит по последовательности (например, списку или диапазону чисел)
for i in range(1, 6):  # range(1, 6) создает последовательность чисел от 1 до 5
    print(i)  # Выводит числа от 1 до 5

# Пример использования цикла for для вывода квадратов чисел
for i in range(1, 4):
    print(i * i)  # Выводит квадраты чисел от 1 до 3
```
```python
# Цикл while выполняется до тех пор, пока условие истинно
i = 1
while i <= 5:  # Условие: i меньше или равно 5
    print(i)  # Выводит числа от 1 до 5
    i += 1  # Увеличивает i на 1 после каждой итерации

# Пример использования цикла while для вывода квадратов чисел
i = 1
while i <= 3:
    print(i * i)  # Выводит квадраты чисел от 1 до 3
    i += 1  # Увеличивает i на 1 после каждой итерации

```
4. Про условия
```python
# Условные конструкции позволяют выполнять код в зависимости от условия
n = int(input("Введите число: "))
if n % 2 == 0:  # Проверяет, является ли число четным
    print("Четное")
else:
    print("Нечетное")

# Пример использования условных конструкций для проверки положительности числа
if n > 0:  # Проверяет, является ли число положительным
    print("Положительное")
else:
    print("Отрицательное")

```
