Конечно! Вот подробный план занятия на 1.5 часа, который поможет вашим студентам лучше понять темы типов данных, циклов `for` и `while`, а также конструкции `int(input())`.

### План занятия

#### 1. Введение (10 минут)
- **Приветствие и цели занятия**: Кратко объясните, что сегодня вы будете повторять и углублять понимание типов данных, циклов `for` и `while`, а также разберете конструкцию `int(input())`.
- **Обзор предыдущих знаний**: Спросите студентов, что они помнят о типах данных, циклах и функции `input()`.

#### 2. Типы данных (20 минут)
- **Презентация**: Покажите слайды с основными типами данных в Python: `int`, `float`, `str`, `bool`, `list`, `tuple`, `dict`.
- **Примеры кода**:
  ```python
  # Целые числа
  a = 10
  print(type(a))  # <class 'int'>

  # Числа с плавающей точкой
  b = 10.5
  print(type(b))  # <class 'float'>

  # Строки
  c = "Hello, World!"
  print(type(c))  # <class 'str'>

  # Булевы значения
  d = True
  print(type(d))  # <class 'bool'>

  # Списки
  e = [1, 2, 3, 4, 5]
  print(type(e))  # <class 'list'>

  # Кортежи
  f = (1, 2, 3, 4, 5)
  print(type(f))  # <class 'tuple'>

  # Словари
  g = {"name": "Alice", "age": 25}
  print(type(g))  # <class 'dict'>
  ```
- **Практическое задание**: Попросите студентов написать несколько строк кода, используя разные типы данных, и вывести их типы на экран.

#### 3. Цикл `for` (20 минут)
- **Презентация**: Объясните синтаксис и применение цикла `for`.
- **Примеры кода**:
  ```python
  # Пример цикла for
  for i in range(5):
      print(i)

  # Итерация по списку
  fruits = ["apple", "banana", "cherry"]
  for fruit in fruits:
      print(fruit)

  # Использование цикла for для создания списка
  squares = [x**2 for x in range(10)]
  print(squares)
  ```
- **Практическое задание**: Попросите студентов написать цикл `for`, который выводит квадраты чисел от 1 до 10.

#### 4. Цикл `while` (20 минут)
- **Презентация**: Объясните синтаксис и применение цикла `while`.
- **Примеры кода**:
  ```python
  # Пример цикла while
  count = 0
  while count < 5:
      print(count)
      count += 1

  # Использование цикла while для ввода данных
  while True:
      user_input = input("Введите число (или 'q' для выхода): ")
      if user_input == 'q':
          break
      print("Вы ввели:", user_input)
  ```
- **Практическое задание**: Попросите студентов написать цикл `while`, который выводит числа от 1 до 10.

#### 5. Конструкция `int(input())` (20 минут)
- **Презентация**: Объясните, почему важно преобразовывать ввод пользователя в нужный тип данных.
- **Примеры кода**:
  ```python
  # Пример использования int(input())
  age = int(input("Введите ваш возраст: "))
  print("Ваш возраст:", age)

  # Пример с обработкой ошибок
  try:
      age = int(input("Введите ваш возраст: "))
      print("Ваш возраст:", age)
  except ValueError:
      print("Пожалуйста, введите целое число.")
  ```
- **Практическое задание**: Попросите студентов написать программу, которая запрашивает у пользователя два числа и выводит их сумму.

#### 6. Заключение и вопросы (10 минут)
- **Обзор пройденного материала**: Кратко повторите основные моменты занятия.
- **Вопросы и ответы**: Ответьте на вопросы студентов и убедитесь, что все поняли материал.
- **Домашнее задание**: Дайте студентам задание написать небольшую программу, использующую все рассмотренные темы (типы данных, циклы `for` и `while`, `int(input())`).

### Пример домашнего задания
Напишите программу, которая запрашивает у пользователя количество чисел, которые он хочет ввести. Затем программа должна запрашивать эти числа одно за другим, суммировать их и выводить результат. Используйте цикл `for` для ввода чисел и цикл `while` для повторного запроса, если пользователь ввел некорректное значение.

```python
# Пример домашнего задания
num_count = int(input("Введите количество чисел: "))
total_sum = 0

for _ in range(num_count):
    while True:
        try:
            number = int(input("Введите число: "))
            total_sum += number
            break
        except ValueError:
            print("Пожалуйста, введите целое число.")

print("Сумма введенных чисел:", total_sum)
```

Этот план занятия поможет вашим студентам лучше понять типы данных, циклы `for` и `while`, а также конструкцию `int(input())`.